README.md

# Table of Contents

1.  [勉強会「広く浅く学ぶ情報リテラシー」](#org9a753fa)
    1.  [勉強会の目的](#org61608e6)
    2.  [はじめに](#orgfc61b36)
        1.  [誰のためか](#org8fca893)
        2.  [誰のためでないか](#org846a91a)
    3.  [現状の業務環境の問題点](#orgddbb6b7)
        1.  [足りていないこと](#org6ff41e7)
        2.  [これらの元凶](#orgd3a4b76)
        3.  [本団体の目的](#org967a81f)
    4.  [CUI に親しむ](#orge378fc9)
        1.  [CUI と GUI](#orgd56923f)
        2.  [プレーンテキストとバイナリファイル](#org7cd515f)
        3.  [UNIX コマンド](#org8c6e5ac)
        4.  [ファイルの本質と拡張子](#org3badc19)
    5.  [プレーンテキストのちから](#org3effc38)
        1.  [エンコードと改行コード](#orgfa1ea17)
        2.  [diff](#orgd56c8cc)
        3.  [grep](#orgb4dbf85)
        4.  [正規表現](#org14b4d94)
        5.  [コラム: DRY 原則](#orgcae9b20)
    6.  [文書: 人間のためのテキスト](#org1f49e5f)
        1.  [エディタ](#org1bdebb1)
        2.  [アウトライナー](#orgcabb907)
        3.  [pandoc](#org58cb467)
        4.  [LaTeX](#orgbe289fe)
    7.  [コード: コンピュータと人間のためのテキスト](#org1933a9e)
        1.  [コンパイル言語とインタプリタ言語](#org51905de)
        2.  [オブジェクト指向言語と関数型言語](#org285a287)
        3.  [リーダブルコード](#org0fa98c3)
        4.  [データ構造](#org652cc15)
        5.  [ディレクトリ構造](#org41c634c)
        6.  [関数化と高階関数](#orgb5ab9da)
        7.  [コラム: YAGNI](#orgfa5c587)
    8.  [開発](#orge1e73a2)
        1.  [TDD](#orgcc81544)
        2.  [Git と GitHub](#org4d1f1d3)
        3.  [継続的インテグレーション](#org7704c59)
        4.  [コンテナ](#org9e884d1)
        5.  [継続的デプロイ](#org09399e7)
        6.  [アジャイル開発とカスケード開発](#orgb5ea613)
        7.  [データベースと2次データ](#org21972a8)
    9.  [雑用と研究への応用](#orgd96f284)
        1.  [雑用](#org6648588)
        2.  [研究](#org5fbe689)

[](
This file is auto-created from README.org.
)


<a id="org9a753fa"></a>

# 勉強会「広く浅く学ぶ情報リテラシー」


<a id="org61608e6"></a>

## 勉強会の目的

コンピュータに仕事を任せるために必要な情報を広く浅く提供し，
受講者のさらなる学びのための足がかりとすること．


<a id="orgfc61b36"></a>

## はじめに

私たちの日々の業務において，コンピュータは不可欠なものです．
本来，コンピュータは我々の仕事を助けてくれるはずのものですが，
その使い方を誤ると，我々は逆にコンピュータに「使われ」，不必要な作業に苦しめられることになります．
特に，プロジェクトがトップダウン型の業務隊形をとっている場合，
不適切な業務命令はプロジェクトの生産性を大きく損ないます．
コンピュータを使った業務，とくに協同作業は，もはや手作業による帳簿作業の延長ではないのです．

コンピュータを使った協同作業に長けているのはソフトウェア開発者たちです．
彼らは20年以上前から生産的な協同作業に最適な手法を模索しつづけており，
その手法は近年，「継続的デリバリー」という形で収束しつつあります．
継続的デリバリーの考え方は，コンピュータでの協同作業を必要とする全ての人が学ぶべき概念ですが，
我々研究者を含め，外部のコミュニティには，ほとんど認知されていないように思います．
この勉強会では，円滑なチームワークを実現するための手法「継続的デリバリー」を学ぶことによって，
コンピュータと我々がどのように業務を分担すべきかを見極める眼を養います．
また，コンピュータに「使われる」働き方から，コンピュータを「使い倒す」働き方へシフトするために必要な情報も，
広く浅く提供します．

たとえ継続的デリバリーそのものを取り入れることが難しかったとしても，
この生産的なワークフローの極致を「知っておく」だけで，身の回りの業務の改善点が見えるようになります．
本勉強会で紹介されるさまざまな技術を即座に身につけるための特効薬はありませんが，
個々の技術間のつながりを一気に学ぶことができれば，のちの独習の効率は飛躍的に向上するはずです．

勉強会は，1回1時間程度，全10回程度を想定しています．


<a id="org8fca893"></a>

### 誰のためか

-   コンピュータが嫌いな人
-   雑用を早く終わらせて研究したい人
-   不必要な雑用はそもそもなければいいのにと思う人


<a id="org846a91a"></a>

### 誰のためでないか

-   既に継続的デリバリーを導入している人
-   単純作業を繰り返すのが好きな人
-   ふってきた業務だけこなしていれば満足な人
-   切れない包丁で料理し続けるのが平気な人


<a id="orgddbb6b7"></a>

## 現状の業務環境の問題点


<a id="org6ff41e7"></a>

### 足りていないこと

-   プログラム化
-   バージョン管理


<a id="orgd3a4b76"></a>

### これらの元凶

-   業務要件の見極めの甘さ
-   Word や Excel などのバイナリファイル


<a id="org967a81f"></a>

### 本団体の目的

ハッカー達の知識を借用して雑用を削減し，研究を加速する


<a id="orge378fc9"></a>

## CUI に親しむ


<a id="orgd56923f"></a>

### CUI と GUI


<a id="org7cd515f"></a>

### プレーンテキストとバイナリファイル


<a id="org8c6e5ac"></a>

### UNIX コマンド


<a id="org3badc19"></a>

### ファイルの本質と拡張子


<a id="org3effc38"></a>

## プレーンテキストのちから


<a id="orgfa1ea17"></a>

### エンコードと改行コード


<a id="orgd56c8cc"></a>

### diff


<a id="orgb4dbf85"></a>

### grep


<a id="org14b4d94"></a>

### 正規表現


<a id="orgcae9b20"></a>

### コラム: DRY 原則


<a id="org1f49e5f"></a>

## 文書: 人間のためのテキスト


<a id="org1bdebb1"></a>

### エディタ


<a id="orgcabb907"></a>

### アウトライナー


<a id="org58cb467"></a>

### pandoc


<a id="orgbe289fe"></a>

### LaTeX


<a id="org1933a9e"></a>

## コード: コンピュータと人間のためのテキスト


<a id="org51905de"></a>

### コンパイル言語とインタプリタ言語


<a id="org285a287"></a>

### オブジェクト指向言語と関数型言語


<a id="org0fa98c3"></a>

### リーダブルコード

1.  命名

2.  コメントの必要性

3.  インデント

4.  リンター


<a id="org652cc15"></a>

### データ構造


<a id="org41c634c"></a>

### ディレクトリ構造


<a id="orgb5ab9da"></a>

### 関数化と高階関数


<a id="orgfa5c587"></a>

### コラム: YAGNI


<a id="orge1e73a2"></a>

## 開発


<a id="orgcc81544"></a>

### TDD


<a id="org4d1f1d3"></a>

### Git と GitHub


<a id="org7704c59"></a>

### 継続的インテグレーション


<a id="org9e884d1"></a>

### コンテナ


<a id="org09399e7"></a>

### 継続的デプロイ


<a id="orgb5ea613"></a>

### アジャイル開発とカスケード開発


<a id="org21972a8"></a>

### データベースと2次データ


<a id="orgd96f284"></a>

## 雑用と研究への応用


<a id="org6648588"></a>

### 雑用

1.  WordとExcelのアンインストール

2.  業務要件の見極めとデータ構造


<a id="org5fbe689"></a>

### 研究

1.  バージョン管理

2.  データベースのブラッシュアップ

3.  プログラム化とパッケージ化

4.  DRY原則に基づく文書作成

5.  文書ビルド環境の正準化

